PaymentCreateAllISPC/results/20211007/BMPaymentV20/PAYCTFORDOMOUTAX_PaymentRead20211007152952808.txt

Status: PASS
Time Taken: 698
Size: 5217
Timestamp: Thu Oct 07 15:29:52 IST 2021
TestStep: PaymentRead

----------------- Messages ------------------------------

----------------- Properties ------------------------------
Endpoint: http://10.246.89.109:20811/pin/services/PINSPayment_V2_0
Encoding: UTF-8

---------------- Request ---------------------------
Request Headers: SOAPAction : ""
Connection : Keep-Alive
User-Agent : Apache-HttpClient/4.5.2 (Java/16.0.1)
Host : 10.246.89.109:20811
Accept-Encoding : gzip,deflate
Content-Length : 1914
Content-Type : text/xml;charset=UTF-8


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsc="http://edb.com/ws/WSCommon_v22" xmlns:urn="urn:pins.payment.evry.com:ws:paymentinitiation:v2_0">
   <soapenv:Header>
      <wsc:AutHeader>
         <wsc:SourceApplication>EVRYCPS</wsc:SourceApplication>
         <wsc:DestinationApplication>PIN</wsc:DestinationApplication>
         <wsc:Function>PIN Create</wsc:Function>
         <wsc:Version>V2_0</wsc:Version>
         <wsc:ClientContext>
            <wsc:userid>27076402170</wsc:userid>
            <wsc:credentials>03110012010400425kglPboRi3h1Z4YUjUpQ0UB65Ta2kPKj1KWwkWemtrL+SoWqMxx/KuqxUVbNyTu6DsSaabKNt2t+xJppso23a37EmmmyjbdrffJeRiGWfHDGwxCWOpDYc2jgSxAz1+8eEsSaabKNt2t/XzlyjxYnxhcG46wcbIKp/sSaabKNt2t9wBUG0SyIoqFfig80Gq4uXVBtimDzTiu2xJppso23a37Emmmyjbdrf8wP73CNrvpw=apG4tU0NraPbbqKUp39erKDFa7xy6z+r4VDMr/6qBlkFniGaNeDXv4cZcZZQQI6JtwB3JYQk6WqLA7oyp1FWRM6n46ehgNmHVNly8fTnQbIuGJSF2LUyGI7aE92/dgtp8jv9bsGpNe58K+xb4LeIHwjb2nVVvt4/2oLtDQ8IPJE=</wsc:credentials>
            <wsc:channel>NBA</wsc:channel>
            <wsc:orgid>4201</wsc:orgid>
            <!--Optional:-->
            <wsc:orgunit>4201</wsc:orgunit>
            <!--Optional:-->
            <wsc:customerid>27076402170</wsc:customerid>
            <!--Optional:-->
            <wsc:locale>en</wsc:locale>
            <wsc:ip>1.1.1.1</wsc:ip>
            <!--Zero or more repetitions:-->
            <wsc:item value="27076402170" key="AgreementId"/>
            <wsc:item value="5ec96c7c-779b-42db-9d44-0bebc3764aed" key="LogRef"/>
            <wsc:item key="PaymentChannel" value="BES"/>
         </wsc:ClientContext>
      </wsc:AutHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:PaymentReadRequest>
         <!--You have a CHOICE of the next 2 items at this level-->
         <urn:transactionId>260897127</urn:transactionId>
      </urn:PaymentReadRequest>
   </soapenv:Body>
</soapenv:Envelope>

---------------- Response --------------------------
Response Headers: Transfer-Encoding : chunked
Server : Jetty(9.4.34.v20201102)
X-sorp : 27076402170;4201;27076402170;EVRYCPS;PIN;PINSPayment_V2_0.PaymentRead;-;5ec96c7c-779b-42db-9d44-0bebc3764aed;0;0;false
#status# : HTTP/1.1 200 OK
Content-Type : text/xml;charset=utf-8


<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns2:PaymentReadResponse xmlns:ns10="urn:pins.payment.evry.com:ws:paymentutil:v2_0" xmlns:ns9="urn:pins.payment.evry.com:domain:paymentutil:v2_0" xmlns:ns8="urn:pins.payment.evry.com:domain:nationalinformation-nor:v2_0" xmlns:ns7="urn:pins.payment.evry.com:domain:creditor:v2_0" xmlns:ns6="urn:pins.payment.evry.com:domain:debtor:v2_0" xmlns:ns5="urn:pins.payment.evry.com:domain:complex-types:v2_0" xmlns:ns4="urn:pins.payment.evry.com:domain:paymentinitiation:v2_0" xmlns:ns3="urn:pins.payment.evry.com:domain:common:v2_0" xmlns:ns2="urn:pins.payment.evry.com:ws:paymentinitiation:v2_0" xmlns="http://edb.com/ws/WSCommon_v22">
         <ns3:ResponseState>
            <ErrorCode>0</ErrorCode>
            <Severity>0</Severity>
            <ComponentId>111</ComponentId>
            <Message>OK</Message>
            <LogSequence xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
         </ns3:ResponseState>
         <ns2:paymentResult>
            <ns4:result>
               <ns4:paymentReference>260897127</ns4:paymentReference>
               <ns4:transactionId>260897127</ns4:transactionId>
               <ns4:messageId>1025712</ns4:messageId>
               <ns4:paymentInfoId>1119161</ns4:paymentInfoId>
               <ns4:initiatorIdentifier>27076402170</ns4:initiatorIdentifier>
               <ns4:paymentStatus>READY_FOR_DUE_DATE</ns4:paymentStatus>
               <ns4:prioritized>false</ns4:prioritized>
               <ns4:originalFormat>CLIENT_GENERATED</ns4:originalFormat>
               <ns4:releaseDate>2021-10-07+02:00</ns4:releaseDate>
               <ns4:internalProductCode>PAYCTFORDOMOUTAX</ns4:internalProductCode>
               <ns4:paymentProduct>PI Domestic</ns4:paymentProduct>
               <ns4:transactionFee currency="NOK">
                  <ns5:amount>25.00</ns5:amount>
               </ns4:transactionFee>
               <ns4:additionalServiceCharge>
                  <ns5:serviceName>Outward OUR</ns5:serviceName>
                  <ns5:charge currency="NOK">
                     <ns5:amount>3.00</ns5:amount>
                  </ns5:charge>
               </ns4:additionalServiceCharge>
               <ns4:paymentIdentification>
                  <ns5:messageIdentification>2483485</ns5:messageIdentification>
                  <ns5:endToEndIdentification>PAYCTFORDOMOUTAX</ns5:endToEndIdentification>
               </ns4:paymentIdentification>
               <ns4:groupHeader>
                  <ns5:creationDateTime>2021-10-07T11:59:49.000+02:00</ns5:creationDateTime>
               </ns4:groupHeader>
               <ns4:paymentInfo>
                  <ns6:paymentMethod>TRF</ns6:paymentMethod>
                  <ns6:paymentTypeInformation>
                     <ns6:instructionPriority>NORM</ns6:instructionPriority>
                     <ns6:categoryPurpose>TAXS</ns6:categoryPurpose>
                  </ns6:paymentTypeInformation>
                  <ns6:requestedExecutionDate>2021-10-07+02:00</ns6:requestedExecutionDate>
                  <ns6:debtorAccount>
                     <ns5:identification>34950211433</ns5:identification>
                     <ns5:currency>NOK</ns5:currency>
                  </ns6:debtorAccount>
                  <ns6:debtorAgentBIC>SPAVNOBBXXX</ns6:debtorAgentBIC>
                  <ns6:debtor>
                     <ns5:name>Amy Hallstein Walderhaug</ns5:name>
                     <ns5:postalAddress>
                        <ns5:postCode>3711</ns5:postCode>
                        <ns5:townName>SKIEN</ns5:townName>
                        <ns5:country>NO</ns5:country>
                        <ns5:addressLine>STENSLI</ns5:addressLine>
                     </ns5:postalAddress>
                  </ns6:debtor>
               </ns4:paymentInfo>
               <ns4:transaction>
                  <ns7:amount>
                     <ns5:instructedAmount currency="NOK">
                        <ns5:amount>1.00</ns5:amount>
                     </ns5:instructedAmount>
                  </ns7:amount>
                  <ns7:chargeBearer>DEBT</ns7:chargeBearer>
                  <ns7:creditorAgent>
                     <ns5:nationalId>6001</ns5:nationalId>
                     <ns5:postalAddress>
                        <ns5:country>NO</ns5:country>
                     </ns5:postalAddress>
                  </ns7:creditorAgent>
                  <ns7:creditor>
                     <ns5:name>Konsert ryddere ANS.</ns5:name>
                     <ns5:postalAddress>
                        <ns5:country>NO</ns5:country>
                     </ns5:postalAddress>
                  </ns7:creditor>
                  <ns7:creditorAccount>
                     <ns5:identification>63450103502</ns5:identification>
                  </ns7:creditorAccount>
                  <ns7:confidential>false</ns7:confidential>
                  <ns7:uetrId>040fe676-d787-4c13-9876-fca002597005</ns7:uetrId>
                  <ns4:remittanceInformation>
                     <ns5:remittanceInformationStructured>
                        <ns5:creditorReferenceInformation>
                           <ns5:type>SCOR</ns5:type>
                           <ns5:reference>7901807251901190010</ns5:reference>
                        </ns5:creditorReferenceInformation>
                     </ns5:remittanceInformationStructured>
                  </ns4:remittanceInformation>
                  <ns4:nationalSpecificPaymentInformation xsi:type="ns8:NorwegianNationalPaymentInformation" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                     <ns8:receiptOrder>NONE</ns8:receiptOrder>
                  </ns4:nationalSpecificPaymentInformation>
               </ns4:transaction>
               <ns4:approver>
                  <ns5:userid>27076402170</ns5:userid>
                  <ns5:name>Bond Mad</ns5:name>
                  <ns5:dateOfApproval>2021-10-07T11:59:51.363+02:00</ns5:dateOfApproval>
               </ns4:approver>
               <ns4:marketType>BM</ns4:marketType>
               <ns4:originalChannel>BES</ns4:originalChannel>
               <ns4:paymentAdditionalInfo>
                  <ns5:debitValueDate>DAY0</ns5:debitValueDate>
                  <ns5:creditValueDate>CUT0</ns5:creditValueDate>
               </ns4:paymentAdditionalInfo>
            </ns4:result>
            <ns4:paymentAmounts>
               <ns5:debitAmount currency="NOK">
                  <ns5:amount>1.00</ns5:amount>
               </ns5:debitAmount>
               <ns5:creditAmount currency="NOK">
                  <ns5:amount>1.00</ns5:amount>
               </ns5:creditAmount>
               <ns5:debitCounterValue currency="NOK">
                  <ns5:amount>1.00</ns5:amount>
               </ns5:debitCounterValue>
               <ns5:creditCounterValue currency="NOK">
                  <ns5:amount>1.00</ns5:amount>
               </ns5:creditCounterValue>
               <ns5:conversionRateInfo>
                  <ns5:rate>1</ns5:rate>
                  <ns5:type>NONE</ns5:type>
                  <ns5:unitNumber>1</ns5:unitNumber>
               </ns5:conversionRateInfo>
            </ns4:paymentAmounts>
            <ns4:operationsArray>UNAPPROVE_PAYMENT</ns4:operationsArray>
            <ns4:operationsArray>VIEW_PAYMENT</ns4:operationsArray>
            <ns4:operationsArray>STOP_PAYMENT</ns4:operationsArray>
            <ns4:operationsArray>PRIORITIZE_PAYMENT</ns4:operationsArray>
         </ns2:paymentResult>
      </ns2:PaymentReadResponse>
   </soap:Body>
</soap:Envelope>
